
#     Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a
# n
#  = a1
#  + (n-1) * d.
# Каждое число вводится с новой строки.


# from random import randint
# n = int(input("Введите первый элемент "))
# m = int(input("Введите разность чисел для прогрессии "))
# c = int(input("Введите число элементов массива "))
# def array (c):
#     return [randint(0, 100) for i in range(c)]

# for i in range(c):
#     print(n + i * m, end=' ')





